/*
После того, как новые книги добавлены в таблицу book, нужно указать к какому жанру они относятся.
Для этого используется запрос на обновление, в котором можно указать значения столбцов из других таблиц,
либо использовать вложенные запросы для получения этих значений.

Пример:
Задать для книги Пастернака «Доктор Живаго»  жанр «Роман».

Если мы знаем код этой книги в таблице book (в нашем случае это 9) и код жанра «Роман»
в таблице genre (это 1), запрос будет очень простым.

Запрос:
UPDATE book
SET genre_id = 1
WHERE book_id = 9;

SELECT * FROM book;

Результат:
Affected rows: 1

Query result:
+---------+-----------------------+-----------+----------+--------+--------+
| book_id | title                 | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
| 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
| 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
| 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
| 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
| 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
| 6       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
| 7       | Черный человек        | 3         | 2        | 570.20 | 12     |
| 8       | Лирика                | 4         | 2        | 518.99 | 2      |
| 9       | Доктор Живаго         | 4         | 1        | 380.80 | 4      |
| 10      | Стихотворения и поэмы | 5         | NULL     | 255.90 | 4      |
| 11      | Остров сокровищ       | 6         | NULL     | 599.99 | 5      |
+---------+-----------------------+-----------+----------+--------+--------+

Более сложным будет запрос, если известно только название жанра (результат будет точно таким же):

Запрос:
UPDATE book
SET genre_id =
      (
       SELECT genre_id
       FROM genre
       WHERE name_genre = 'Роман'
      )
WHERE book_id = 9;

SELECT * FROM book;
*/
# --------------------------------------------------------------------------
/*
Задание:
Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия»,
а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса).
*/

update book
set genre_id =
    (select genre_id
     from genre
     where name_genre = 'Поэзия')
where book.title = 'Стихотворения и поэмы';

update book
set genre_id =
        (select genre_id
         from genre
         where name_genre = 'Приключения')
where book.title = 'Остров сокровищ';

select * from book;