/*
Удаление записей главной таблицы с сохранением записей в зависимой

При создании таблицы для внешних ключей с помощью ON DELETE устанавливаются опции,
которые определяют действия, выполняемые при удалении связанной строки из главной
таблицы.

Если задано SET NULL, то при удалении связанной строки из главной таблицы в зависимой,
в столбце внешнего ключа, устанавливается значение NULL. (При этом в столбце
внешнего ключа должно быть допустимо значение NULL)

В таблице book эта опция установлена на поле genre_id.

Пример:
Удалим из таблицы genre все  жанры, название которых заканчиваются на «я» ,
а в таблице book  -  для этих жанров установим значение Null.

Запрос:
DELETE FROM genre
WHERE name_genre LIKE "%я";

SELECT * FROM genre;

SELECT * FROM book;

Результат:

Affected rows: 2

Query result:
+----------+------------+
| genre_id | name_genre |
+----------+------------+
| 1        | Роман      |
+----------+------------+
Affected rows: 1

Query result:
+---------+-----------------------+-----------+----------+--------+--------+
| book_id | title                 | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
| 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
| 2       | Белая гвардия         | 1         | 1        | 540.50 | 12     |
| 3       | Идиот                 | 2         | 1        | 437.11 | 13     |
| 4       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
| 5       | Игрок                 | 2         | 1        | 480.50 | 10     |
| 6       | Стихотворения и поэмы | 3         | Null     | 650.00 | 15     |
| 7       | Черный человек        | 3         | Null     | 570.20 | 12     |
| 8       | Лирика                | 4         | Null     | 518.99 | 2      |
| 9       | Доктор Живаго         | 4         | 1        | 380.80 | 4      |
| 10      | Стихотворения и поэмы | 5         | Null     | 255.90 | 4      |
| 11      | Остров сокровищ       | 6         | Null     | 599.99 | 5      |
+---------+-----------------------+-----------+----------+--------+--------+
Affected rows: 11

В нашем случае удалились жанры «Поэзия» и «Приключения».
*/

# --------------------------------------------------------------------------

/*
Задание:
Удалить все жанры, к которым относится меньше 4-х наименований книг.
В таблице book для этих жанров установить значение Null.
*/

delete from genre
where genre.genre_id in (
    select book.genre_id
    from book
    group by book.genre_id
    having count(amount)<4);

select * from genre;

select * from book;