/*
Задание:
Для каждого города посчитать, сколько раз сотрудники в нем были.  Информацию вывести в отсортированном
в алфавитном порядке по названию городов. Вычисляемый столбец назвать Количество.

Результат:
+-----------------+------------+
| city            | Количество |
+-----------------+------------+
| Владивосток     | 3          |
| Воронеж         | 1          |
| Москва          | 7          |
| Новосибирск     | 4          |
| Санкт-Петербург | 3          |
| Томск           | 2          |
+-----------------+------------+
*/

select city, count(name) as 'Количество'
from trip
group by city
order by city